In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### For these exercises you have to use the students table that was created in the notebook 02 and the alumni table created in the notebook 04 plus a new table called mentorship

In [2]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (5, 'Eve', 18, None),
 (6, 'Mark', 25, 'History')]

In [3]:
%%sql
SELECT * FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(7, 'Grace', 2019, 'Arts'),
 (8, 'Hannah', 2021, 'History'),
 (9, 'Ian', 2020, 'Biology'),
 (10, 'Diana', 2023, 'Biology'),
 (11, 'Alice', 2022, 'Civil Engineering'),
 (12, 'Frank', 2020, 'Social Work')]

In [4]:
%%sql
SELECT * FROM mentorship;

 * postgresql://user:***@localhost:5432/postgres
7 rows affected.

[('Alice', 'Bob', 'Economics'),
 ('Bob', 'Charlie', 'Chemistry'),
 ('Hannah', 'Diana', 'Computer Science'),
 ('Grace', 'Mark', 'History'),
 ('Alice', 'Grace', 'Arts'),
 ('Frank', 'Ian', 'Biology'),
 ('Eve', 'Frank', 'Social Work')]

### 1. Find the names of students whose age is greater than the average age of all students

In [5]:
%%sql 
SELECT AVG(age) FROM students;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[(Decimal('20.8333333333333333'),)]

In [6]:
%%sql
SELECT name, age
FROM students
WHERE age > (SELECT AVG(age) FROM students);

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Bob', 22), ('Diana', 21), ('Mark', 25)]

### 2. Select the names of alumni who studied a major that no current student is studying.

Hint: you can use NOT EXISTS

In [7]:
%%sql
-- interesting finding, since None is not a major, it removes the row for Eve
SELECT name, major
FROM students
WHERE major NOT IN (SELECT major FROM alumni);

 * postgresql://user:***@localhost:5432/postgres
4 rows affected.

[('Alice', 'Computer Science'),
 ('Bob', 'Economics'),
 ('Charlie', 'Chemistry'),
 ('Diana', 'Computer Science')]

In [8]:
%%sql
-- bring the alumni only IF NO STUDENT EXISTS with the same major
SELECT name, major
FROM students s
WHERE NOT EXISTS (
    SELECT 1
    FROM alumni a
    WHERE s.major = a.major
)

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[('Alice', 'Computer Science'),
 ('Bob', 'Economics'),
 ('Charlie', 'Chemistry'),
 ('Diana', 'Computer Science'),
 ('Eve', None)]

### 3. Select all students (other than Alice) who are in the same major as Alice.

In [9]:
%%sql
SELECT name FROM students WHERE name != 'Alice';

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[('Bob',), ('Charlie',), ('Diana',), ('Eve',), ('Mark',)]

In [10]:
%%sql
SELECT name, major
FROM students
WHERE name NOT IN (SELECT name FROM students WHERE name = 'Alice')
    AND
    major = 'Computer Science';

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Diana', 'Computer Science')]

### 4. Select the name(s) of the youngest student(s). Use a subquery to find the minimum age.

In [11]:
%%sql
SELECT name, age
FROM students
WHERE age = (SELECT MIN(age) FROM students);

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Eve', 18)]

### 5. Find all majors that have more than one student, also select their names. Use a subquery with COUNT.

Hint: use correlated subquery

In [12]:
%%sql 
SELECT name, major 
FROM students
WHERE major IN(
    SELECT major
    FROM students
    GROUP BY major
    HAVING COUNT(*) > 1);

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Alice', 'Computer Science'), ('Diana', 'Computer Science')]

### 6. Select the names of people who appear both in the students table and the alumni table.

In [13]:

%%sql
SELECT name
FROM students
WHERE name IN (
    SELECT name FROM alumni 
)

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Alice',), ('Diana',)]

### 7. Find all alumni who studied a major that appears as a mentee’s major in the mentorship table.

In [14]:
%%sql
SELECT name AS alumni_name, major
FROM alumni 
WHERE major IN (
    SELECT major
    FROM mentorship
)

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Grace', 'Arts'),
 ('Hannah', 'History'),
 ('Ian', 'Biology'),
 ('Diana', 'Biology'),
 ('Alice', 'Civil Engineering'),
 ('Frank', 'Social Work')]

### 8. Find all students who are not listed as mentees in the mentorship table.

Hint: you can use NOT EXISTS

In [15]:
%%sql
--option 1 without not exists
SELECT name 
FROM students
WHERE name NOT IN(
    SELECT mentee_name FROM mentorship 
)

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Alice',), ('Eve',)]

In [16]:
%%sql
-- bring the students only IF NO OTHER row EXISTS where mentee appears
SELECT name
FROM students s
WHERE NOT EXISTS(
    SELECT 1
    FROM mentorship m 
    WHERE m.mentee_name = s.name
);

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Alice',), ('Eve',)]

### 9. Select the names of mentors whose mentee’s major is different from their own major (mentor major must come from the students or alumni table).

In [17]:
%%sql
WITH names_majors AS(
    SELECT name, major
        FROM students 
        UNION ALL
        SELECT name, major
        FROM alumni
        )

SELECT  *
FROM (
    SELECT mentor_name, nm.major, m.mentee_major
    FROM mentorship m
    LEFT JOIN names_majors nm
    ON m.mentor_name = nm.name)
WHERE major != mentee_major;

 * postgresql://user:***@localhost:5432/postgres
8 rows affected.

[('Alice', 'Computer Science', 'Arts'),
 ('Alice', 'Computer Science', 'Economics'),
 ('Bob', 'Economics', 'Chemistry'),
 ('Grace', 'Arts', 'History'),
 ('Hannah', 'History', 'Computer Science'),
 ('Alice', 'Civil Engineering', 'Arts'),
 ('Alice', 'Civil Engineering', 'Economics'),
 ('Frank', 'Social Work', 'Biology')]

### 10. Select all students whose age is greater than the age of at least one alumni (you may assume alumni have a column for age in your schema, or adapt accordingly).

In [18]:
%%sql

SELECT name, age
FROM students
WHERE age < (SELECT MIN(graduation_year - 2000) AS alumni_years_old
    FROM alumni)

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Eve', 18)]